#!/bin/bash

# Display the banner
cat << "EOF"
███╗░░██╗░█████╗░██████╗░░██████╗██╗░░██╗██╗░░██╗░█████╗░██████╗░███████╗
████╗░██║██╔══██╗██╔══██╗██╔════╝██║░░██║██║░░██║██╔══██╗██╔══██╗██╔════╝
██╔██╗██║██║░░██║██████╔╝╚█████╗░███████║███████║███████║██████╔╝█████╗░░
██║╚████║██║░░██║██╔══██╗░╚═══██╗██╔══██║██╔══██║██╔══██║██╔══██╗██╔══╝░░
██║░╚███║╚█████╔╝██║░░██║██████╔╝██║░░██║██║░░██║██║░░██║██║░░██║███████╗
╚═╝░░╚══╝░╚════╝░╚═╝░░╚═╝╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚═╝╚══════╝  
                                                          
EOF

echo "🚀 Updating system packages..."
apt update

echo "🔧 Installing required packages..."
apt install -y sudo
apt install -y systemctl

echo "  Adding PufferPanel repository..."
curl -s https://packagecloud.io/install/repositories/pufferpanel/pufferpanel/script.deb.sh?any=true | sudo bash

echo "  Updating package list..."
sudo apt update

echo "  Installing PufferPanel Stuff..."
sudo apt-get install -y pufferpanel

echo "  Creating a PufferPanel user..."
sudo pufferpanel user add

echo "  Starting Puffer Panel"
sudo systemctl enable --now pufferpanel

echo "🔥 PufferPanel is Now installed and running!"
echo "📢 Join My Discord for more scripts 👉 https://discord.gg/jRdam7CK"